In [1]:
import os
import sys

os.environ["PYSPARK_PYTHON"]=sys.executable
os.environ["PYSPARK_DRIVER_PYTHON"]=sys.executable

**GroupBy() and Aggregate Function**


In PySpark, the groupBy operation is used to group data based on one or more columns and perform aggregate operations on each group. Here are some examples of how to use groupBy in PySpark:

In [2]:
# Import required libraries
from pyspark.sql import SparkSession
from pyspark.sql.functions import count, mean

# Create a SparkSession
spark = SparkSession.builder \
    .appName("GroupByExample") \
    .getOrCreate()

# Create a DataFrame
data = [("Alice", "Sales", 5000),
        ("Bob", "HR", 6000),
        ("Alice", "Finance", 7000),
        ("Bob", "Finance", 8000),
        ("Charlie", "Sales", 5500)]
columns = ["Name", "Department", "Salary"]
df = spark.createDataFrame(data, schema=columns)

# Group by the "Department" column and calculate aggregate functions
result = df.groupBy("Department") \
            .agg(count("Name").alias("EmployeeCount"), 
                 mean("Salary").alias("AvgSalary"))

# Show the result
result.show()

# Stop the SparkSession
spark.stop()

+----------+-------------+---------+
|Department|EmployeeCount|AvgSalary|
+----------+-------------+---------+
|     Sales|            2|   5250.0|
|        HR|            1|   6000.0|
|   Finance|            2|   7500.0|
+----------+-------------+---------+

In [2]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("PySpark_example").getOrCreate()

In [14]:
df_pyspark=spark.read.csv("test.csv",header=True,inferSchema=True)
df_pyspark.show()

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Chandu|Data Science| 50000|
|Rashmi |         IOT| 75000|
|  Rohit|    Big Data| 55000|
| Rohit |    Big Data| 80000|
|  Ronit|         IOT| 60000|
|  Ronit|Data Science| 70000|
| Chandu|Data Science| 45000|
|Krishna|    Big Data| 65000|
| Rashmi|    Big Data| 85000|
|  Rohit|         IOT| 60000|
+-------+------------+------+

**groupBy() using multiple columns**)

In [16]:
df_pyspark.groupBy("name","department").sum("salary").show()

+-------+------------+-----------+
|   name|  department|sum(salary)|
+-------+------------+-----------+
|  Rohit|    Big Data|      55000|
| Rashmi|    Big Data|      85000|
| Chandu|Data Science|      95000|
|  Ronit|Data Science|      70000|
| Rohit |    Big Data|      80000|
|  Ronit|         IOT|      60000|
|Krishna|    Big Data|      65000|
|Rashmi |         IOT|      75000|
|  Rohit|         IOT|      60000|
+-------+------------+-----------+

**sum()**

Compute the sum for each numeric columns for each group.

In [4]:
df_pyspark.groupBy("department").sum("salary").show()

+------------+-----------+
|  department|sum(salary)|
+------------+-----------+
|         IOT|     195000|
|    Big Data|     285000|
|Data Science|     165000|
+------------+-----------+

**min()**

Computes the min value for each numeric column for each group.

In [5]:
df_pyspark.groupBy("department").min("salary").show()

+------------+-----------+
|  department|min(salary)|
+------------+-----------+
|         IOT|      60000|
|    Big Data|      55000|
|Data Science|      45000|
+------------+-----------+

**max()**

Computes the max value for each numeric columns for each group.

In [6]:
df_pyspark.groupBy("department").max("salary").show()

+------------+-----------+
|  department|max(salary)|
+------------+-----------+
|         IOT|      75000|
|    Big Data|      85000|
|Data Science|      70000|
+------------+-----------+

**avg()**

Computes average values for each numeric columns for each group.

In [7]:
df_pyspark.groupBy("department").avg("salary").show()

+------------+-----------+
|  department|avg(salary)|
+------------+-----------+
|         IOT|    65000.0|
|    Big Data|    71250.0|
|Data Science|    55000.0|
+------------+-----------+

**mean()**

Computes average values for each numeric columns for each group

mean() is an alias for avg()..

In [8]:
df_pyspark.groupBy("department").mean("salary").show()

+------------+-----------+
|  department|avg(salary)|
+------------+-----------+
|         IOT|    65000.0|
|    Big Data|    71250.0|
|Data Science|    55000.0|
+------------+-----------+

**count()**

Counts the number of records for each group.

In [9]:
df_pyspark.groupBy("department").count().show()

+------------+-----+
|  department|count|
+------------+-----+
|         IOT|    3|
|    Big Data|    4|
|Data Science|    3|
+------------+-----+

**min()**

Computes the min value for each numeric column for each group.

In [10]:
df_pyspark.groupBy("name","department").min("salary").show()

+-------+------------+-----------+
|   name|  department|min(salary)|
+-------+------------+-----------+
|  Rohit|    Big Data|      55000|
| Rashmi|    Big Data|      85000|
| Chandu|Data Science|      45000|
|  Ronit|Data Science|      70000|
| Rohit |    Big Data|      80000|
|  Ronit|         IOT|      60000|
|Krishna|    Big Data|      65000|
|Rashmi |         IOT|      75000|
|  Rohit|         IOT|      60000|
+-------+------------+-----------+

**pivot(pivot_col, values=None)**

Pivots a column of the current DataFrame and perform the specified aggregation. There are two versions of pivot function: one that requires the caller to specify the list of distinct values to pivot on, and one that does not. The latter is more concise but less efficient, because Spark needs to first compute the list of distinct values internally


Parameters:
	 
pivot_col – Name of the column to piv  
 
 .
values – List of values that will be translated to columns in the output DataFrame.
.

In [12]:
df_pyspark.groupBy("department").pivot("Name").sum("salary").show()

+------------+------+-------+------+-------+-----+------+-----+
|  department|Chandu|Krishna|Rashmi|Rashmi |Rohit|Rohit |Ronit|
+------------+------+-------+------+-------+-----+------+-----+
|         IOT|  NULL|   NULL|  NULL|  75000|60000|  NULL|60000|
|    Big Data|  NULL|  65000| 85000|   NULL|55000| 80000| NULL|
|Data Science| 95000|   NULL|  NULL|   NULL| NULL|  NULL|70000|
+------------+------+-------+------+-------+-----+------+-----+

**groupBy() and agg() function**

In [17]:
df_pyspark.groupBy("department").agg(({"salary":"sum"})).show()

+------------+-----------+
|  department|sum(salary)|
+------------+-----------+
|         IOT|     195000|
|    Big Data|     285000|
|Data Science|     165000|
+------------+-----------+

**Handling Missing Values Pyspark**

In [20]:
df_pyspark1=spark.read.csv("test2.csv",header=True,inferSchema=True)
df_pyspark1.show()

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Shudhanshu|  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|      Paul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL|  NULL|
|      NULL|NULL|        10| 40000|
|      NULL|  34|        10| 38000|
|      NULL|NULL|      NULL|  NULL|
|      NULL|  36|      NULL|  NULL|
+----------+----+----------+------+

**Dropping rows based on null values**

In [21]:
df_pyspark1.na.drop().show()

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Shudhanshu| 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|      Paul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
+----------+---+----------+------+

**drop() has the following parameters — how, thresh, and subset**

In [22]:
df_pyspark1.na.drop(how="all").show()
 # if all values in rows are null then drop # default any

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Shudhanshu|  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|      Paul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|    Mahesh|NULL|      NULL|  NULL|
|      NULL|NULL|        10| 40000|
|      NULL|  34|        10| 38000|
|      NULL|  36|      NULL|  NULL|
+----------+----+----------+------+

In [23]:
df_pyspark1.na.drop(how="any",thresh=2).show() 
#atleast 2 non null values should be present.

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Shudhanshu|  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|      Paul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|      NULL|NULL|        10| 40000|
|      NULL|  34|        10| 38000|
+----------+----+----------+------+

In [24]:
df_pyspark1.na.drop(how="any",subset=["salary"]).show()
 # only in that column rows get deleted

+----------+----+----------+------+
|      Name| age|Experience|Salary|
+----------+----+----------+------+
|     Krish|  31|        10| 30000|
|Shudhanshu|  30|         8| 25000|
|     Sunny|  29|         4| 20000|
|      Paul|  24|         3| 20000|
|    Harsha|  21|         1| 15000|
|   Shubham|  23|         2| 18000|
|      NULL|NULL|        10| 40000|
|      NULL|  34|        10| 38000|
+----------+----+----------+------+

**Filling missing values — Single Value**

In [27]:
df_pyspark1.na.fill('Missing Values').show() #string values will get replaced as string is given as input

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|    Shudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|NULL|      NULL|  NULL|
|Missing Values|NULL|        10| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|NULL|      NULL|  NULL|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [28]:
df_pyspark1.na.fill(0).show() 
#integer values will get replaced as integer is given as input

+----------+---+----------+------+
|      Name|age|Experience|Salary|
+----------+---+----------+------+
|     Krish| 31|        10| 30000|
|Shudhanshu| 30|         8| 25000|
|     Sunny| 29|         4| 20000|
|      Paul| 24|         3| 20000|
|    Harsha| 21|         1| 15000|
|   Shubham| 23|         2| 18000|
|    Mahesh|  0|         0|     0|
|      NULL|  0|        10| 40000|
|      NULL| 34|        10| 38000|
|      NULL|  0|         0|     0|
|      NULL| 36|         0|     0|
+----------+---+----------+------+

**Filling missing values using Mean, Median, or Mode with help of the Imputer function**

In [30]:
#filling with mean 
from pyspark.ml.feature import Imputer
imputer = Imputer(inputCols=["age"],outputCols=["age_imputed"]).setStrategy("mean")

In [31]:
imputer.fit(df_pyspark1).transform(df_pyspark1).show()

+----------+----+----------+------+-----------+
|      Name| age|Experience|Salary|age_imputed|
+----------+----+----------+------+-----------+
|     Krish|  31|        10| 30000|         31|
|Shudhanshu|  30|         8| 25000|         30|
|     Sunny|  29|         4| 20000|         29|
|      Paul|  24|         3| 20000|         24|
|    Harsha|  21|         1| 15000|         21|
|   Shubham|  23|         2| 18000|         23|
|    Mahesh|NULL|      NULL|  NULL|         28|
|      NULL|NULL|        10| 40000|         28|
|      NULL|  34|        10| 38000|         34|
|      NULL|NULL|      NULL|  NULL|         28|
|      NULL|  36|      NULL|  NULL|         36|
+----------+----+----------+------+-----------+

**orderBy() and sort() in Pyspark DataFrame**

In [32]:
df_pyspark.show()

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Chandu|Data Science| 50000|
|Rashmi |         IOT| 75000|
|  Rohit|    Big Data| 55000|
| Rohit |    Big Data| 80000|
|  Ronit|         IOT| 60000|
|  Ronit|Data Science| 70000|
| Chandu|Data Science| 45000|
|Krishna|    Big Data| 65000|
| Rashmi|    Big Data| 85000|
|  Rohit|         IOT| 60000|
+-------+------------+------+

**sort() — To sort a dataframe by using one or more columns, Default — ascending order**

In [33]:
df_pyspark.sort("salary").show() # Sort based on single column

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Chandu|Data Science| 45000|
| Chandu|Data Science| 50000|
|  Rohit|    Big Data| 55000|
|  Ronit|         IOT| 60000|
|  Rohit|         IOT| 60000|
|Krishna|    Big Data| 65000|
|  Ronit|Data Science| 70000|
|Rashmi |         IOT| 75000|
| Rohit |    Big Data| 80000|
| Rashmi|    Big Data| 85000|
+-------+------------+------+

In [34]:
df_pyspark.sort(df_pyspark["salary"].desc()).show() # sort based on descending order

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Rashmi|    Big Data| 85000|
| Rohit |    Big Data| 80000|
|Rashmi |         IOT| 75000|
|  Ronit|Data Science| 70000|
|Krishna|    Big Data| 65000|
|  Ronit|         IOT| 60000|
|  Rohit|         IOT| 60000|
|  Rohit|    Big Data| 55000|
| Chandu|Data Science| 50000|
| Chandu|Data Science| 45000|
+-------+------------+------+

In [37]:
df_pyspark.sort("salary","name").show() # Sort based on first column then second column

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Chandu|Data Science| 45000|
| Chandu|Data Science| 50000|
|  Rohit|    Big Data| 55000|
|  Rohit|         IOT| 60000|
|  Ronit|         IOT| 60000|
|Krishna|    Big Data| 65000|
|  Ronit|Data Science| 70000|
|Rashmi |         IOT| 75000|
| Rohit |    Big Data| 80000|
| Rashmi|    Big Data| 85000|
+-------+------------+------+

In [36]:
df_pyspark.orderBy("salary").show() # Sort based on single column

+-------+------------+------+
|   name|  department|salary|
+-------+------------+------+
| Chandu|Data Science| 45000|
| Chandu|Data Science| 50000|
|  Rohit|    Big Data| 55000|
|  Ronit|         IOT| 60000|
|  Rohit|         IOT| 60000|
|Krishna|    Big Data| 65000|
|  Ronit|Data Science| 70000|
|Rashmi |         IOT| 75000|
| Rohit |    Big Data| 80000|
| Rashmi|    Big Data| 85000|
+-------+------------+------+

**join() using pyspark** :

PySpark Join is used to combine two DataFrames and by chaining these you can join multiple DataFrames;

 it supports all basic join type operations available in traditional SQL like INNER, LEFT OUTER, RIGHT OUTER, LEFT ANTI, LEFT SEMI, CROSS, SELF join.

In [38]:
emp = [(1,"Smith",-1,"2018","10","M",3000),(2, "Rose",1 , "2010", "20","M", 4000),(3,"Williams",1,"2010","10","M",1000),(4, "Jones",2 ,"2005","10","F",2000),(5,"Brown",2,"2010","40","",-1),(6, "Brown", 2, "2010","50","",-1)]
empColumns = ["emp_id","name","superior_emp_id","year_joined", "emp_dept_id","gender","salary"]

empDF = spark.createDataFrame(data=emp, schema = empColumns)
empDF.printSchema()
empDF.show()

root
 |-- emp_id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- superior_emp_id: long (nullable = true)
 |-- year_joined: string (nullable = true)
 |-- emp_dept_id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     5|   Brown|              2|       2010|         40|      |    -1|
|     6|   Brown|              2|       2010|         50|      |    -1|
+------+--------+---------------+-----------+-----------+------+------+

In [39]:
dept = [("Finance",10),("Marketing",20),("Sales",30),("IT",40)]
deptColumns = ["dept_name","dept_id"]
deptDF = spark.createDataFrame(data=dept, schema = deptColumns)
deptDF.printSchema()
deptDF.show()

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

**Inner Join**

In [40]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"inner") .show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Outer Join**

In [41]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"outer").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Left Join**

In [44]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"left").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [45]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Right Join**

In [46]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"right").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [47]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"rightouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Leftsemi Join**

In [48]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftsemi").show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     5|   Brown|              2|       2010|         40|      |    -1|
+------+--------+---------------+-----------+-----------+------+------+

**Left Anti Join**

In [49]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftanti").show()

+------+-----+---------------+-----------+-----------+------+------+
|emp_id| name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-----+---------------+-----------+-----------+------+------+
|     6|Brown|              2|       2010|         50|      |    -1|
+------+-----+---------------+-----------+-----------+------+------+

**Union() using pyspark**

To merge two or more dataframes of same schema or structure union() is used.

In [50]:
# Creating a dataframe 
data_frame1 = spark.createDataFrame( 
    [("Bhuwanesh", 82.98), ("Harshit", 80.31)], 
    ["Student Name", "Overall Percentage"] 
) 
  
# Creating another dataframe 
data_frame2 = spark.createDataFrame( 
    [("Naveen", 91.123), ("Piyush", 90.51)], 
    ["Student Name", "Overall Percentage"] 
) 
  
# union() 
answer = data_frame1.union(data_frame2) 
  
# Print the result of the union() 
answer.show()

+------------+------------------+
|Student Name|Overall Percentage|
+------------+------------------+
|   Bhuwanesh|             82.98|
|     Harshit|             80.31|
|      Naveen|            91.123|
|      Piyush|             90.51|
+------------+------------------+

**UnionAll()  in PySpark**

UnionAll() function does the same task as union() function but this function is deprecated since Spark “2.0.0” version. Hence, union() function is recommended.

In [51]:
answer = data_frame1.unionAll(data_frame2) 
  
# Print the union of both the dataframes 
answer.show()

+------------+------------------+
|Student Name|Overall Percentage|
+------------+------------------+
|   Bhuwanesh|             82.98|
|     Harshit|             80.31|
|      Naveen|            91.123|
|      Piyush|             90.51|
+------------+------------------+

**Merge without Duplicates**

Since the union() method returns all rows without distinct records, we will use
t h**e distinct**() function to return just one record when a duplicate exists.

In [52]:
simpleData = [("James","Sales","NY",90000,34,10000), \
("Michael","Sales","NY",86000,56,20000), \
("Robert","Sales","CA",81000,30,23000), \
("Maria","Finance","CA",90000,24,23000) \
]
columns= ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)
simpleData2 = [("James","Sales","NY",90000,34,10000), \
("Maria","Finance","CA",90000,24,23000), \
("Jen","Finance","NY",79000,53,15000), \
("Jeff","Marketing","CA",80000,25,18000), \
("Kumar","Marketing","NY",91000,50,21000) \
]
columns2= ["employee_name","department","state","salary","age","bonus"]
df2 = spark.createDataFrame(data = simpleData2, schema = columns2)
df2.printSchema()
df2.show(truncate=False)
unionDF = df.union(df2)
unionDF.show(truncate=False)
disDF = df.union(df2).distinct()
disDF.show(truncate=False)
unionAllDF = df.unionAll(df2)
unionAllDF.show(truncate=False)
unionAllDF.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
+-------------+----------+-----+------+---+-----+

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+